{
    "users": [
      {
        "id": 1,
        "image": "https://users-api-images.s3.us-east-2.amazonaws.com/aatrox.png",
        "name": "AATROX THE DARKIN BLADE",
        "lore": "Once honored defenders of Shurima against the Void, Aatrox and his brethren would eventually become an even greater threat to Runeterra, and were defeated only by cunning mortal sorcery. But after centuries of imprisonment, Aatrox was the first to find freedom once more, corrupting and transforming those foolish enough to try and wield the magical weapon that contained his essence. Now, with stolen flesh, he walks Runeterra in a brutal approximation of his previous form, seeking an apocalyptic and long overdue vengeance.",
        "attributes": "Health(650 – 2588) Mana(N/A) Health regen.(per 5s)(3–20) Mana regen.(N/A) Armor(38 – 113.65) Attack damage(60 – 145) Magic resist.(32 – 66.85) Crit. damage 175%<Move. speed 345 Attack range 175 Base attack speed 0.651 Attack windup 19.737% AS ratio N/A Bonus AS (0 – 42.5%)",
        "skills": [
          {
            "name": "Deathbringer Stance",
            "skillDescription": "Aatrox's next basic attack gains 50 extra range, deals [4 - 12%] (at levels 1 - 18) of the target's Max Health as physical damage (max: 100 against monsters) and heals himself for 80% of the post-mitigation bonus damage dealt, reduced to 25% of the damage dealt when stabbing a minion. Cooldown is reduced by 2 seconds when Aatrox hits a Champion or Large Monster with basic attacks or abilities and for each enemy champion hit with the edge of the of The Darkin Blade.",
            "cooldown": 24
          },
          {
            "name": "The Darkin Blade",
            "skillDescription": "Aatrox slams his greatsword down, dealing 10/30/50/70/90 (+60/65/70/75/80% Attack Damage) physical damage (minions take 40% damage). The Darkin Blade may be re-cast 2 additional times, each one increasing the damage by 25%. Each strike can hit with the Edge, briefly knocking enemies up for 0.25 seconds and dealing 60% more damage.",
            "cooldown": 14
          },
          {
            "name": "Infernal Chains",
            "skillDescription": "Aatrox smashes the ground, dealing 30/40/50/60/70 (+40 total attack damage) physical damage to the first enemy hit and slowing by 25/27.5/30/32.5/35% for 1.5 seconds. Champions or Large Monsters have 1.5s to leave the impact area or be dragged back and damaged again.",
            "cooldown": 20
          },
          {
            "name": "Umbral Dash",
            "skillDescription": "Passive: Aatrox gains 18/19.5/21/22.5/24% Omnivamp against champions, increased to 20/24/28/32/36% Omnivamp during World Ender. Active: Aatrox dashes. He can use this Ability while winding up his other Abilities.",
            "cooldown": 9
          },
          {
            "name": "World Ender",
            "skillDescription": "After 0.25 Aatrox reveals his true demonic form for 10 seconds. On activation, he fears nearby enemy minions for 3 seconds and gains 60/80/100 Movement Speed, decaying over the duration. While World Ender persists, he gains 20/32.5/45% Attack Damage and increases self healing by 25/35/45%. On enemy champion takedown, World Ender is extended by 5 seconds.",
            "cooldown": 120
          }
        ]
      },
          {
            "id": 2,
            "image": "https://users-api-images.s3.us-east-2.amazonaws.com/ahri.jpeg",
            "name": "AHRI THE NINE-TAILED FOX",
            "lore": "Innately connected to the magic of the spirit realm, Ahri is a fox-like vastaya who can manipulate her prey's emotions and consume their essence—receiving flashes of their memory and insight from each soul she consumes. Once a powerful yet wayward predator, Ahri is now traveling the world in search of remnants of her ancestors while also trying to replace her stolen memories with ones of her own making.",
            "attributes": "Health (590 – 2222) Mana (418 – 843) Health regen. (per 5s)(2.5 – 12.7) Mana regen. (per 5s)(8 – 21.6) Armor(21 – 100.9) Attack damage (53 – 104) Magic resist. (30 – 52.1) Crit. damage 175 Move. speed 330 Attack range 550 Base attack speed 0.668 Attack windup 20.054% AS ratio N/A Bonus AS (0 – 34%)",
            "skills": [
              {
                "name": "Vastayan Grace",
                "skillDescription": "Killing minions or monsters grants Ahri an Essence Fragment. After obtaining 9 Essence Fragments, Ahri consumes them to heal for 35-95 (+20% bonus Ability Power). When Ahri scores a takedown against an enemy champion within 3 seconds of damaging them, she feasts upon their Essence, healing for 75-165 (+30% bonus Ability Power).",
                "cooldown": 8
              },
              {
                "name": "Orb of Deception",
                "skillDescription": "Deals 40/65/90/115/140 (+45% bonus Ability Power) magic damage on the way out, and 40/65/90/115/140 (+45% bonus Ability Power) true damage on the way back.",
                "cooldown": 14
              },
              {
                "name": "Fox-Fire",
                "skillDescription": "Releases fox-fires that seek nearby enemies during 2.5 seconds and deal 50/75/100/125/150 (+30% bonus Ability Power) magic damage and gains a burst of decaying 40% Movement Speed that lasts for 2 seconds. Enemies hit with multiple fox-fires take 30% damage from each additional fox-fire beyond the first, for a maximum of 64/104/144/184/224 +48% bonus Ability Power damage to a single enemy. (Fox-fire prioritizes champions recently hit by Charm, then enemies Ahri recently attacked.) (If Fox-fire cannot find a priority target, it targets champions over the nearest enemy if possible.) (Minions below 20% health take 200% damage.)",
                "cooldown": 9
              },
              {
                "name": "Charm",
                "skillDescription": "Blows a kiss that deals 80/110/140/170/200 (+40% bonus Ability Power) magic damage and charms the first enemy hit, causing them to walk harmlessly towards Ahri for 1.2/1.4/1.6/1.8/2 second(s), and immediately stopping any in-progress movement abilities.",
                "cooldown": 14
              },
              {
                "name": "Spirit Rush",
                "skillDescription": "Ahri Nimbly dashes forward firing 3 essence bolts at nearby enemies, prioritizing champions. These bolts deal 60/90/120 (+35% bonus Ability Power) magic damage each. Spirit Rush can be recast up to 2 more times within 15 seconds. Consuming a champion's Essence with Essence Theft during this period extends the recast window by up to 10 seconds and grants an additional recast of Spirit Rush (up to 3 stored).",
                "cooldown": 130
              }
            ]
          },
              {
                "id": 3,
                "image": "https://users-api-images.s3.us-east-2.amazonaws.com/akali.jpeg",
                "name": "AKALI THE ROGUE ASSASSIN",
                "lore": "Abandoning the Kinkou Order and her title of the Fist of Shadow, Akali now strikes alone, ready to be the deadly weapon her people need. Though she holds onto all she learned from her master Shen, she has pledged to defend Ionia from its enemies, one kill at a time. Akali may strike in silence, but her message will be heard loud and clear: fear the assassin with no master.",
                "attributes": "Health (570 – 2593) Energy 20 Health regen. (per 5s) (9 – 24.3) Energy regen. (per 5s) 50 Armor (23 – 102.9) Attack damage(62 – 118.1 Magic resist. (37 – 71.85) Crit. damage 175%Move. speed 345 Attack range 125 Gameplay radius 65 Selection radius 100 Pathing radius 30 Acq. radius 400",
                "skills": [
                  {
                    "name": "Assassin's Mark",
                    "skillDescription": "Dealing spell damage to a champion creates a ring of energy around them for 5 seconds, granting her 35/40/45/50% bonus movement speed for 2 seconds while moving towards the edge of the ring. Exiting that ring empowers Akali's next autoattack, gains 125 bonus range and deals 35 - 182 (+ 60% bonus Attack Damage) (+ 55% bonus Ability Power) magic damage.",
                    "cooldown": 24
                  },
                  {
                    "name": "Five Point Strike",
                    "skillDescription": "Slings kunai in an arc, dealing 40/65/90/115/140 (+65% bonus Attack Damage) (+60% bonus Ability Power) magic damage. Enemies at the tip are slowed by 50 for 0.5 seconds.",
                    "cooldown": 1.5
                  },
                  {
                    "name": "Twilight Shroud",
                    "skillDescription": "Akali drops a smoke bomb, unleashing a spreading cover of smoke lasting 5/5.5/6/6.5/7 seconds. The smoke grants Akali invisibility and 30/35/40/45/50% decaying movement speed for 2 seconds. Stealth - Invisible: Akali can only be revealed by nearby enemy Turrets or True Sight. Akali increases her energy by 100 while the shroud is active.",
                    "cooldown": 20
                  },
                  {
                    "name": "Shuriken Flip",
                    "skillDescription": "Flip backward and fire a shuriken forward, dealing 30/56.25/82.5/108.75/135 (+85% Attack Damage) (+120% bonus Ability Power) magic damage and marking the first enemy or smoke cloud hit. Re-cast: Dash to the marked target, dealing 70/131.25/192.5/253.75/315(+85% Attack Damage) (+120% bonus Ability Power).",
                    "cooldown": 16
                  },
                  {
                    "name": "Perfect Execution",
                    "skillDescription": "Two dashes: The first vaults over target enemy, dealing 80/220/360 (+50% bonus Attack Damage) (+30% bonus Ability Power) magic damage to all enemies Akali dashes over. Akali can dash again after 2.5 seconds. The second is an untargeted piercing thrust that executes, dealing 60/130/200 (+30% bonus Ability Power) to 180/390/600 (+90% bonus Ability Power) magic damage based on missing health.",
                    "cooldown": 100
                  }
                ]
              }

    ]
  }
